MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx120f064h.h
#define _U7ASTA_ADDEN_POSITION                   0x00000005
#define _U7ASTA_ADDEN_MASK                       0x00000020
#define _U7ASTA_ADDEN_LENGTH                     0x00000001

#define _U7ASTA_URXISEL_POSITION                 0x00000006
#define _U7ASTA_URXISEL_MASK                     0x000000C0
#define _U7ASTA_URXISEL_LENGTH                   0x00000002

#define _U7ASTA_TRMT_POSITION                    0x00000008
#define _U7ASTA_TRMT_MASK                        0x00000100
#define _U7ASTA_TRMT_LENGTH                      0x00000001

#define _U7ASTA_UTXBF_POSITION                   0x00000009
#define _U7ASTA_UTXBF_MASK                       0x00000200
#define _U7ASTA_UTXBF_LENGTH                     0x00000001

#define _U7ASTA_UTXEN_POSITION                   0x0000000A
#define _U7ASTA_UTXEN_MASK                       0x00000400
#define _U7ASTA_UTXEN_LENGTH                     0x00000001

#define _U7ASTA_UTXBRK_POSITION                  0x0000000B
#define _U7ASTA_UTXBRK_MASK                      0x00000800
#define _U7ASTA_UTXBRK_LENGTH                    0x00000001

#define _U7ASTA_URXEN_POSITION                   0x0000000C
#define _U7ASTA_URXEN_MASK                       0x00001000
#define _U7ASTA_URXEN_LENGTH                     0x00000001

#define _U7ASTA_UTXINV_POSITION                  0x0000000D
#define _U7ASTA_UTXINV_MASK                      0x00002000
#define _U7ASTA_UTXINV_LENGTH                    0x00000001

#define _U7ASTA_UTXISEL_POSITION                 0x0000000E
#define _U7ASTA_UTXISEL_MASK                     0x0000C000
#define _U7ASTA_UTXISEL_LENGTH                   0x00000002

#define _U7ASTA_ADDR_POSITION                    0x00000010
#define _U7ASTA_ADDR_MASK                        0x00FF0000
#define _U7ASTA_ADDR_LENGTH                      0x00000008

#define _U7ASTA_ADM_EN_POSITION                  0x00000018
#define _U7ASTA_ADM_EN_MASK                      0x01000000
#define _U7ASTA_ADM_EN_LENGTH                    0x00000001

#define _U7ASTA_URXISEL0_POSITION                0x00000006
#define _U7ASTA_URXISEL0_MASK                    0x00000040
#define _U7ASTA_URXISEL0_LENGTH                  0x00000001

#define _U7ASTA_URXISEL1_POSITION                0x00000007
#define _U7ASTA_URXISEL1_MASK                    0x00000080
#define _U7ASTA_URXISEL1_LENGTH                  0x00000001

#define _U7ASTA_UTXISEL0_POSITION                0x0000000E
#define _U7ASTA_UTXISEL0_MASK                    0x00004000
#define _U7ASTA_UTXISEL0_LENGTH                  0x00000001

#define _U7ASTA_UTXISEL1_POSITION                0x0000000F
#define _U7ASTA_UTXISEL1_MASK                    0x00008000
#define _U7ASTA_UTXISEL1_LENGTH                  0x00000001

#define _U7ASTA_UTXSEL_POSITION                  0x0000000E
#define _U7ASTA_UTXSEL_MASK                      0x0000C000
#define _U7ASTA_UTXSEL_LENGTH                    0x00000002

#define _U7ASTA_w_POSITION                       0x00000000
#define _U7ASTA_w_MASK                           0xFFFFFFFF
#define _U7ASTA_w_LENGTH                         0x00000020

#define _PMCON_RDSP_POSITION                     0x00000000
#define _PMCON_RDSP_MASK                         0x00000001
#define _PMCON_RDSP_LENGTH                       0x00000001

#define _PMCON_WRSP_POSITION                     0x00000001
#define _PMCON_WRSP_MASK                         0x00000002
#define _PMCON_WRSP_LENGTH                       0x00000001

#define _PMCON_CS1P_POSITION                     0x00000003
#define _PMCON_CS1P_MASK                         0x00000008
#define _PMCON_CS1P_LENGTH                       0x00000001

#define _PMCON_CS2P_POSITION                     0x00000004
#define _PMCON_CS2P_MASK                         0x00000010
#define _PMCON_CS2P_LENGTH                       0x00000001

#define _PMCON_ALP_POSITION                      0x00000005
#define _PMCON_ALP_MASK                          0x00000020
#define _PMCON_ALP_LENGTH                        0x00000001

#define _PMCON_CSF_POSITION                      0x00000006
#define _PMCON_CSF_MASK                          0x000000C0
#define _PMCON_CSF_LENGTH                        0x00000002

#define _PMCON_PTRDEN_POSITION                   0x00000008
#define _PMCON_PTRDEN_MASK                       0x00000100
#define _PMCON_PTRDEN_LENGTH                     0x00000001

#define _PMCON_PTWREN_POSITION                   0x00000009
#define _PMCON_PTWREN_MASK                       0x00000200
#define _PMCON_PTWREN_LENGTH                     0x00000001

#define _PMCON_PMPTTL_POSITION                   0x0000000A
#define _PMCON_PMPTTL_MASK                       0x00000400
#define _PMCON_PMPTTL_LENGTH                     0x00000001

#define _PMCON_ADRMUX_POSITION                   0x0000000B
#define _PMCON_ADRMUX_MASK                       0x00001800
#define _PMCON_ADRMUX_LENGTH                     0x00000002

#define _PMCON_SIDL_POSITION                     0x0000000D
#define _PMCON_SIDL_MASK                         0x00002000
#define _PMCON_SIDL_LENGTH                       0x00000001

#define _PMCON_ON_POSITION                       0x0000000F
#define _PMCON_ON_MASK                           0x00008000
#define _PMCON_ON_LENGTH                         0x00000001

#define _PMCON_DUALBUF_POSITION                  0x00000011
#define _PMCON_DUALBUF_MASK                      0x00020000
#define _PMCON_DUALBUF_LENGTH                    0x00000001

#define _PMCON_RDSTART_POSITION                  0x00000017
#define _PMCON_RDSTART_MASK                      0x00800000
#define _PMCON_RDSTART_LENGTH                    0x00000001

#define _PMCON_CSF0_POSITION                     0x00000006
#define _PMCON_CSF0_MASK                         0x00000040
#define _PMCON_CSF0_LENGTH                       0x00000001

#define _PMCON_CSF1_POSITION                     0x00000007
#define _PMCON_CSF1_MASK                         0x00000080
#define _PMCON_CSF1_LENGTH                       0x00000001

#define _PMCON_ADRMUX0_POSITION                  0x0000000B
#define _PMCON_ADRMUX0_MASK                      0x00000800
#define _PMCON_ADRMUX0_LENGTH                    0x00000001

